<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 133.0.3065.69--><displayName/><description/><resources><stringTable><string id="Network_group">Настройки сети</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant">Сделайте Access-Control-Allow-Methods соответствующим CORS спецификации перед запуском</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant_Explain">Эта политика определяет, будут ли методы запроса указываться в верхнем регистре при сопоставлении с заголовками ответов Access-Control-Allow-Methods в предварительной проверке CORS.

Если вы отключите эту политику, методы запроса будут указаны в верхнем регистре. Это реакция на событие Microsoft Edge 108 или более ранней версии.

Если вы включите или не настроите эту политику, методы запроса не будут записываться в верхний регистр, если только они не будут сопоставлены без учета регистра с DELETE, GET, HEAD, OPTIONS, POST или PUT.

Это приведет к отклонению заголовка ответа fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: FOO&quot;,
и примет заголовок ответа fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: Foo&quot;.

Примечание: методы запроса &quot;post&quot; и &quot;put&quot; не затрагиваются, в то время как &quot;patch&quot; затрагивается.

Эта политика является временной и будет удалена в будущем.</string><string id="BlockTruncatedCookies">Блокировать усеченные файлы cookie (устарела)</string><string id="BlockTruncatedCookies_Explain">УСТАРЕВШАЯ: эта политика устарела. Она не действует в версиях Microsoft Edge, следующих за версией 131.

Эта политика предоставляет временное согласие на изменение способа обработки файлов cookie, Microsoft Edge с помощью JavaScript, содержащих определенные управляющие символы (NULL, возврат каретки и веб-канал строки).
Ранее наличие любого из этих символов в строке cookie приведет к усечению, но по-прежнему установлено.
Теперь наличие этих символов приведет к пропуску всей строки файлов cookie.

Если эта политика включена или не настроена, новое поведение будет включено.

Если эта политика отключена, старое поведение включено.

Эта политика устарела, так как она изначально была реализована в качестве меры безопасности в случае разбоя, но ни о одной из них не сообщалось.</string><string id="ZstdContentEncodingEnabled">Включить поддержку кодирования контента zstd</string><string id="ZstdContentEncodingEnabled_Explain">Эта функция включает поддержку объявления &quot;zstd&quot; в заголовке запроса Accept-Encoding и поддержку распаковки веб-контента zstd.

Если эта политика включена или не настроена, Microsoft Edge будет принимать ответы сервера, сжатые с помощью zstd.

Если эта политика отключена, кодирование содержимого zstd не будет объявляться и не будет поддерживаться при обработке ответов сервера.

Эта политика является временной и в будущем станет нерекомендованной к использованию.</string><string id="WebView2LoaderOverrideSettings_group">Параметры переопределения загрузчика</string><string id="BrowserExecutableFolder">Настройка расположения исполняемой папки браузера</string><string id="BrowserExecutableFolder_Explain">Эта политика задает приложения WebView2 для использования среды выполнения WebView2 по указанному пути. Папка должна содержать следующие файлы: msedgewebview2.exe, msedge.dll и т. д.

Чтобы задать значение для пути к папке, укажите имя значения и пару значений. В качестве имени значения укажите идентификатор пользовательской модели приложения или имя исполняемого файла. Для применения ко всем приложениям можно использовать в качестве имени значения подстановочный знак &quot;*&quot;.

Пример значения:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Настройка расположения исполняемой папки браузера</string><string id="ChannelSearchKind">Настройка типа поиска канала выпуска WebView2</string><string id="ChannelSearchKind_Explain">Эта политика настраивает тип поиска канала для приложений WebView2. По умолчанию типу поиска канала присвоено значение &quot;0&quot;, что эквивалентно типу поиска &quot;Самый стабильный&quot; в соответствующем API WebView2. Это означает, что при создании среды WebView2 должен выполняться поиск канала выпуска от наиболее до наименее стабильного: WebView2 Runtime, Beta, Dev и Canary.

Чтобы использовать обратный порядок поиска по умолчанию и применять тип поиска &quot;Наименее стабильный&quot;, настройте для этой политики значение &quot;1&quot;.

Чтобы настроить значение для типа поиска канала, укажите имя значения и пару значений. В качестве имени значения укажите идентификатор пользовательской модели приложения или имя исполняемого файла. Для применения ко всем приложениям можно использовать в качестве имени значения подстановочный знак &quot;*&quot;.

Пример значения:

Name: WebView2APISample.exe, Value: 1</string><string id="ChannelSearchKindDesc">Настройка типа поиска канала выпуска WebView2</string><string id="ReleaseChannelPreference">Настройка предпочтений порядка поиска в канале выпуска (не рекомендуется)</string><string id="ReleaseChannelPreference_Explain">УСТАРЕЛО. Эта политика устарела. В настоящее время она поддерживается, но станет устаревшей в будущем выпуске.

Эта политика заменяется на ChannelSearchKind с аналогичными функциями. Она станет устаревшей в выпуске 124. По умолчанию задан следующий порядок поиска в каналах: WebView2 Runtime, Beta, Dev и Canary.

Чтобы изменить заданный по умолчанию порядок, установите для данной политики значение &quot;1&quot;.

Чтобы задать значение параметра предпочтения каналов выпуска, укажите имя значения и пару значений. В качестве имени значения укажите идентификатор пользовательской модели приложения или имя исполняемого файла. Для применения ко всем приложениям можно использовать в качестве имени значения подстановочный знак &quot;*&quot;.

Пример значения:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Настройка предпочтений порядка поиска в канале выпуска (не рекомендуется)</string><string id="ReleaseChannels">Настройка каналов выпуска WebView2</string><string id="ReleaseChannels_Explain">Эта политика настраивает параметры канала выпуска для приложений WebView2. Чтобы настроить эти параметры, задайте для значения строку целых чисел с разделителями-запятыми, которые сопоставляются со значениями &quot;COREWEBVIEW2_RELEASE_CHANNELS&quot; из соответствующего API WebView2. Эти значения: WebView2 Runtime (0), Beta (1), Dev (2) и Canary (3). По умолчанию при создании среды выполняется поиск каналов от наиболее до наименее стабильного с использованием первого канала, найденного на устройстве. Если предоставлен параметр 'ReleaseChannels' (Настройка каналов выпуска WebView2), при создании среды будет выполняться поиск только каналов, указанных в заданном значении. Например, значения &quot;0,2&quot; и &quot;2,0&quot; указывают, что при создании среды следует искать только канал Dev и WebView2 Runtime, используя порядок, указанный в 'ChannelSearchKind' (Настройка типа поиска канала выпуска WebView2). При создании среды выполняется попытка интерпретации каждого целого числа и любая недопустимая запись будет считаться каналом Stable. Настройте 'ChannelSearchKind' на обратный порядок поиска, чтобы при создании среды сначала выполнялся поиск наименее стабильной сборки. Если одновременно указаны параметры 'BrowserExecutableFolder' (Настройка расположения исполняемой папки браузера) и 'ReleaseChannels', 'BrowserExecutableFolder' получает приоритет независимо от того, включен ли канал 'BrowserExecutableFolder' в 'ReleaseChannels'.

Чтобы задать значение для каналов выпуска, укажите имя значения и пару значений. В качестве имени значения укажите идентификатор пользовательской модели приложения или имя исполняемого файла. Для применения ко всем приложениям можно использовать в качестве имени значения подстановочный знак &quot;*&quot;.

Пример значения:

Name: WebView2APISample.exe, Value: 0,1,2</string><string id="ReleaseChannelsDesc">Настройка каналов выпуска WebView2</string><string id="ExperimentationAndConfigurationServiceControl">Управление связью со службой &quot;Служба расширенной конфигурации&quot;</string><string id="ExperimentationAndConfigurationServiceControl_Explain">Для развертывания полезных данных экспериментов и конфигураций в клиенте используется Служба расширенной конфигурации.

Полезные данные экспериментов представляют собой список средств разработки, которые корпорация Майкрософт предоставляет для тестирования и обратной связи.

Полезные данные конфигурации представляют собой список рекомендуемых настроек, которые Майкрософт хочет реализовать для оптимизации взаимодействия с пользователем.

Кроме того, полезные данные конфигурации также могут содержать список действий, которые необходимо выполнить с определенными доменами по причинам совместимости. Например, браузер может переопределить строку &quot;Агент пользователя&quot; на веб-сайте, если этот веб-сайт не работает. Каждое из этих действий применяется в течение ограниченного времени, пока Майкрософт пытается устранить проблему с владельцем сайта.

Если для этой политики задан режим &quot;FullMode&quot;, из Службы расширенной конфигурации загружаются все полезные данные, относящиеся как к экспериментам, так и к конфигурации.

Если для этой политики задан режим &quot;ConfigurationsOnlyMode&quot;, загружаются только полезные данные конфигурации.

Если для этой политики задан режим &quot;RestrictedMode&quot;, обмен данными со Службой расширенной конфигурации полностью прекращается. Майкрософт не рекомендует выбирать этот параметр.

Если не настроить эту политику на управляемом устройстве, в каналах Stable и Beta выполняется тот же сценарий, что и при режиме &quot;ConfigurationsOnlyMode&quot;. В каналах Canary и Dev выполняется тот же сценарий, что и при режиме &quot;FullMode&quot;.

Если не настроить эту политику на неуправляемом устройстве, выполняется тот же сценарий, что и при режиме &quot;FullMode&quot;.

Сопоставление параметров политики:

* FullMode (2) = Получать конфигурации и эксперименты

* ConfigurationsOnlyMode (1) = Получать только конфигурации

* RestrictedMode (0) = Отключить связь со службой &quot;Служба расширенной конфигурации&quot;

Используйте предоставленную выше информацию при настройке этой политики.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Получать конфигурации и эксперименты</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Получать только конфигурации</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Отключить связь со службой &quot;Служба расширенной конфигурации&quot;</string><string id="ForcePermissionPolicyUnloadDefaultEnabled">Определяет, можно ли отключить обработчики события unload.</string><string id="ForcePermissionPolicyUnloadDefaultEnabled_Explain">Обработчики события unload упраздняются. Их срабатывание зависит от политики Permissions-Policy unload.
В настоящее время они по умолчанию разрешены политикой. В будущем они будут постепенно запрещаться, а сайтам потребуется включать их явным образом при использовании заголовков Permissions-Policy.
С помощью этой корпоративной политики можно отказаться от этого постепенного упразднения, чтобы по умолчанию эти обработчики событий остались включенными.

Страницы могут использовать обработчики события unload, чтобы сохранять данные или сигнализировать серверу об окончании сеанса пользователя.
Такой поход не рекомендуется использовать, так как при этом ограничивается надежность и снижается производительность из-за блокирования использования BackForwardCache.
Существуют рекомендуемые альтернативные решения, но событие unload используется уже очень давно, некоторые приложения могут по-прежнему использовать это событие в своей работе.

Если эта политика отключена или не настроена, обработчики события unload будут постепенно упразднены в соответствии с развертыванием упразднения, а сайты, на которых не задан заголовок Permissions-Policy, перестанут инициировать события &quot;unload&quot;.

Если эта политика включена, обработчики события unload будут по-прежнему работать по умолчанию.</string><string id="HttpAllowlist">Белый список HTTP</string><string id="HttpAllowlist_Explain">Настройка политики определяет список имен узлов или шаблонов имен узлов (например, &quot;[*.]example.com&quot;), которые не будут обновлены до HTTPS и не будут отображать межстраничные объявления об ошибках, если включен режим HTTPS-First. Организации могут использовать эту политику для сохранения доступа к серверам, не поддерживающим HTTPS, без необходимости отключения &quot;AutomaticHttpsDefault&quot;.

Предоставленные имена узлов должны быть канонизированы: все IDN должны быть преобразованы в формат A-метки, а все буквы ASCII должны быть строчными.

Общие подстановочные знаки узла (например, &quot;*&quot; или &quot;[*]&quot;) не допускаются. Вместо этого режим HTTPS-First Mode и обновления HTTPS должны быть явно отключены с помощью соответствующих политик.

Примечание. Эта политика не применяется к обновлениям HSTS.

Пример значения:

testserver.example.com
[*.]example.org</string><string id="HttpAllowlistDesc">Белый список HTTP</string><string id="NewBaseUrlInheritanceBehaviorAllowed">Позволяет включить функцию NewBaseUrlInheritanceBehavior. (не рекомендуется)</string><string id="NewBaseUrlInheritanceBehaviorAllowed_Explain">УСТАРЕЛО. Эта политика устарела. В настоящее время она поддерживается, но станет устаревшей в будущем выпуске.

NewBaseUrlInheritanceBehavior — это Microsoft Edge, из-за которого кадры about:blank и about:srcdoc постоянно наследуют значения базовых URL-адресов через моментальные снимки базового URL-адреса инициатора.

Если эта политика отключена, пользователи или Microsoft Edge варианты не смогут включить NewBaseUrlInheritanceBehavior в случае обнаружения проблем совместимости.

Если эта политика включена или не настроена, она позволяет включить NewBaseUrlInheritanceBehavior.

Эта политика устарела, так как функция NewBaseUrlInheritanceBehaviorAllowed удалена.

Эта политика будет устаревшей в выпуске 133.</string><string id="NewPDFReaderWebView2List">Включить встроенное средство чтения PDF-файлов на платформе Adobe Acrobat webView2</string><string id="NewPDFReaderWebView2List_Explain">Эта политика настраивает приложения WebView2 для запуска новой версии средства чтения PDF-файлов на платформе Adobe Acrobat. Новое средство чтения PDF-файлов обеспечивает доступность всех функций и улучшенный интерфейс взаимодействия с PDF. Этот интерфейс включает расширенную отрисовку, улучшенную производительность, повышенную безопасность для обработки PDF-файлов и улучшение специальных возможностей.

Если эта политика указана для приложения, она также может повлиять на другие связанные приложения. Политика применяется ко всем элементам WebView2, которые совместно используют одну папку данных пользователя WebView2. Эти элементы WebView2 могут относиться к нескольким приложениям, если эти приложения (часто из одного семейства продуктов) предназначены для совместного использования одной папки данных пользователя.

Используйте пару &quot;имя-значение&quot;, чтобы включить новое средство чтения PDF-файлов для приложения. Настройте имя идентификатора пользовательской модели приложения или имя исполняемого файла. Вы можете использовать подстановочный знак &quot;*&quot; в качестве имени значения для применения ко всем приложениям. Настройте значение true, чтобы включить новое средство чтения, или значение false, чтобы использовать существующее.

Если эта политика включена для указанных приложений WebView2, они будут использовать новое средство чтения PDF на платформе Adobe Acrobat, чтобы открывать все PDF-файлы.

Если политика отключена для указанных приложений WebView2 или не настроена, они будут использовать существующее средство чтения PDF для открытия всех PDF-файлов.

Пример значения:

{&quot;name&quot;: &quot;app1.exe&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;app_id_for_app2&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;*&quot;, &quot;value&quot;: false}</string><string id="NewPDFReaderWebView2ListDesc">Включить встроенное средство чтения PDF-файлов на платформе Adobe Acrobat webView2</string><string id="RSAKeyUsageForLocalAnchorsEnabled">Проверка использования ключа RSA для сертификатов сервера, выданных локальными якорями доверия. (не рекомендуется)</string><string id="RSAKeyUsageForLocalAnchorsEnabled_Explain">УСТАРЕЛО. Эта политика устарела. В настоящее время она поддерживается, но станет устаревшей в будущем выпуске.

Эта политика устарела, так как функция RSAKeyUsageForLocalAnchorsEnabled удалена.

Эта политика будет удалена в версии 133.

Расширение использования ключа X.509 объявляет, как ключ в сертификате может быть
использованный. Эти инструкции гарантируют, что сертификаты не используются непреднамеренная
контекст, который защищает от класса меж протокольных атак на HTTPS и
других протоколов. HTTPS-клиенты должны проверить соответствие сертификатов сервера
параметры TLS подключения.

Начиная с Microsoft Edge 124, это
проверка всегда включен.

Microsoft Edge 123 и более ранних версий имеют
следующее поведение:

Если эта политика включена,
Microsoft Edge будет выполнять этот ключ
проверка. Это помогает предотвратить атаки, в которые злоумышленник управляет браузером
интерпретация ключа способами, которые не предполагались владельцем сертификата.

Если эта политика отключена,
Microsoft Edge этот ключ будет пропущен проверка
HTTPS-подключения, которые согласуют TLS 1.2 и используют RSA-сертификат, который
цепочек к локальному якорю доверия. Примеры локальных якорей доверия:
предоставляемых политикой или установленных пользователем корневых сертификатов. Во всех остальных случаях
проверка выполняется независимо от параметра этой политики.

Если эта политика не настроена,
Microsoft Edge будет вести себя так, как если бы
политика включена.

Эта политика доступна администраторам для предварительного просмотра поведения
будущий выпуск, который включит проверка по умолчанию. В этот момент это
политика останется временно доступной для администраторов, которым требуется больше
время обновления сертификатов для соответствия новым требованиям к использованию ключа RSA.

Connections сбоя этого проверка с ошибкой
ERR_SSL_KEY_USAGE_INCOMPATIBLE. Сайты, на которых произошел сбой с этой ошибкой, вероятно, имеют
неправильно настроенный сертификат. Современные ECDHE_RSA комплекты шифров используют
Параметр использования ключа &quot;digitalSignature&quot;, в то время как устаревшие комплекты шифров расшифровки RSA
используйте параметр использования ключа &quot;keyEncipherment&quot;. Если нет данных, администраторы должны
включить оба сертификата RSA, предназначенные для HTTPS.</string><string id="SUPPORTED_WIN7_V97">Версия Microsoft Edge 97, Windows 7 или более поздняя версия</string><string id="SUPPORTED_WIN7_V116">Версия Microsoft Edge 116, Windows 7 или более поздняя версия</string><string id="SUPPORTED_WIN7_V118">Версия Microsoft Edge 118, Windows 7 или более поздняя версия</string><string id="SUPPORTED_WIN7_V87">Версия Microsoft Edge 87, Windows 7 или более поздняя версия</string><string id="SUPPORTED_WIN7_V121">Версия Microsoft Edge 121, Windows 7 или более поздняя версия</string><string id="SUPPORTED_WIN7_V123">Версия Microsoft Edge 123, Windows 7 или более поздняя версия</string><string id="SUPPORTED_WIN7_V125">Версия Microsoft Edge 125, Windows 7 или более поздняя версия</string><string id="OBSOLETE_WIN7_V123_V131">Microsoft Edge версий 123–131, Windows 7 или более поздней версии</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Настройки по умолчанию (пользователи могут переопределять)</string></stringTable><presentationTable><presentation id="AccessControlAllowMethodsInCORSPreflightSpecConformant"/><presentation id="BlockTruncatedCookies"/><presentation id="ZstdContentEncodingEnabled"/><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Установите параметр для идентификатора пользовательской модели приложения или имени исполняемого файла. Для применения ко всем приложениям вы можете использовать подстановочный знак &quot;*&quot; в качестве параметра.</listBox></presentation><presentation id="ChannelSearchKind"><listBox refId="ChannelSearchKindDesc">Установите параметр для идентификатора пользовательской модели приложения или имени исполняемого файла. Для применения ко всем приложениям вы можете использовать подстановочный знак &quot;*&quot; в качестве параметра.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Установите параметр для идентификатора пользовательской модели приложения или имени исполняемого файла. Для применения ко всем приложениям вы можете использовать подстановочный знак &quot;*&quot; в качестве параметра.</listBox></presentation><presentation id="ReleaseChannels"><listBox refId="ReleaseChannelsDesc">Установите параметр для идентификатора пользовательской модели приложения или имени исполняемого файла. Для применения ко всем приложениям вы можете использовать подстановочный знак &quot;*&quot; в качестве параметра.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Управление связью со службой &quot;Служба расширенной конфигурации&quot;</dropdownList></presentation><presentation id="ForcePermissionPolicyUnloadDefaultEnabled"/><presentation id="HttpAllowlist"><listBox refId="HttpAllowlistDesc">Белый список HTTP</listBox></presentation><presentation id="NewBaseUrlInheritanceBehaviorAllowed"/><presentation id="NewPDFReaderWebView2List"><listBox refId="NewPDFReaderWebView2ListDesc">Установите параметр для идентификатора пользовательской модели приложения или имени исполняемого файла. Для применения ко всем приложениям вы можете использовать подстановочный знак &quot;*&quot; в качестве параметра.</listBox></presentation><presentation id="RSAKeyUsageForLocalAnchorsEnabled"/></presentationTable></resources></policyDefinitionResources>